schemas/src/main/resources/ogc/sos/2.0/examples/_useCase_airbase_station_network/GetFeatureOfInterest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd
http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd" xmlns:sos="http://www.opengis.net/sos/2.0" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap12:Header>
		<wsa:To>http://mySOSURL</wsa:To>
		<wsa:Action>http://www.opengis.net/def/serviceOperation/sos/foiRetrieval/2.0/GetFeatureOfInterest</wsa:Action>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:MessageID>http://my.client.com/uid/msg-0010</wsa:MessageID>
	</soap12:Header>
	<soap12:Body>
<GetFeatureOfInterest xmlns="http://www.opengis.net/sos/2.0"
	service="SOS" version="2.0.0">
  
	<spatialFilter>
		<fes:Contains>
			<fes:ValueReference>sams:shape</fes:ValueReference>
			<gml:Envelope srsName="http://www.opengis.net/def/crs/EPSG/0/4326">
				<gml:lowerCorner>50 4</gml:lowerCorner>
				<gml:upperCorner>53 8</gml:upperCorner>
			</gml:Envelope>
		</fes:Contains>
	</spatialFilter>
  
</GetFeatureOfInterest>

</soap12:Body>
</soap12:Envelope>