schemas/src/main/resources-original/ogc/sos/2.0/examples/enhancedOperations/GetObservationById.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--=====================================================================
Example SOAP Request for GetObservationById operation which contains identifier of observations.
=======================================================================-->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd
http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd" xmlns:sos="http://www.opengis.net/sos/2.0" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap12:Header>
		<wsa:To>http://mySOSURL</wsa:To>
		<wsa:Action>http://www.opengis.net/def/serviceOperation/sos/obsByIdRetrieval/2.0/GetObservationById</wsa:Action>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:MessageID>http://my.client.com/uid/msg-0010</wsa:MessageID>
	</soap12:Header>
	<soap12:Body>
		<sos:GetObservationById service="SOS" version="2.0.0">
			<!-- ID of the observation which should be returned. -->
			<sos:observation>http://www.my_namespace.org/water_gage_1_observations/observation1</sos:observation>
		</sos:GetObservationById>
	</soap12:Body>
</soap12:Envelope>
