52n-sos-spring/52n-sos-spring-common-views/src/main/webapp/static/examples/sos_v20/requests_soap/GetObservationById.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
	<env:Body>
		<sos:GetObservationById service="SOS" version="2.0.0" xmlns:sos="http://www.opengis.net/sos/2.0"
			xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0.0/sos.xsd">
			<sos:observation>test_observation_1</sos:observation>
			<sos:observation>test_observation_2</sos:observation>
		</sos:GetObservationById>
	</env:Body>
</env:Envelope>
